NordicPlayground/nrf51-ADC-examples/ble_app_template__ADC_sampling__app_trace__NUS/main.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 */

/*
 * This project is an add-on to the ble_app_template application of nRF51 SDK 9.0.0
 * The add-on consists of ADC code in order to sample an analog input pin with the 
 * internal ADC and write the result out on UART. If the PCA_10028 board is used 
 * (nRF51-DK) the 3xLSB of the ADC result is also written out on LED_2, LED_3 and
 * LED_4 on the PCA_10028 board. LED_1 flashes to indicate the device is advertising
 * but is lid up when the board is connected.
 *
 * periodic app_timer is used to trigger the ADC sampling. At startup, the app_timer
 * is started. When the app_timer expires, the application receives a timer callback.
 * In the timer callback handler, the ADC sampling is started. when the ADC sampling
 * finishes, the ADC interrupt handler is executed which logs the result on LEDs and 
 * UART and on NUS service. The printout on UART is performed by the app_trace library. 
 * 
 * This file contains source code for a sample application that uses the Nordic UART service (NUS).
 * Connect via BLE with Master Control Panel and the PCA10000/PCA10031 dongle, running
 * the master emulator firmware (MEFW).
 *
 * To see the ADC result that is printed out on UART, you can set up a UART terminal. 
 * You should configure it as described on 
 * http://infocenter.nordicsemi.com/topic/com.nordic.infocenter.sdk51.v9.0.0/lib_trace.html?cp=4_1_0_3_6
 * If you use windows PC, you can e.g. use http://sourceforge.net/projects/realterm/
 * as the UART terminal. To see what port the board connects on, you could open 
 * Device Manager on Windows and see what ports are connected. Unplug the USB plug
 * to the nRF51 development board to see what port disappears in Device Manager, 
 * then connect the USB plug again to connect the board.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf51_bitfields.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "ble_nus.h"

#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define DEVICE_NAME                      "Nordic_UART"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 300                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       180                                        /**< The advertising timeout in units of seconds. */

#define APP_TIMER_PRESCALER              0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS             (6+BSP_APP_TIMERS_NUMBER)                  /**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE          4                                          /**< Size of timer operation queues. */

#define ADC_SAMPLING_INTERVAL            APP_TIMER_TICKS(200, APP_TIMER_PRESCALER) /**< Sampling rate for the ADC */

#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(100, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(200, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                   1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define ADC_RESOLUTION            			 ADC_CONFIG_RES_10bit         //Calibration is only performed for 10-bit ADC resolution

static dm_application_instance_t        m_app_handle;                               /**< Application identifier allocated by device manager */

