NordicPlayground/nrf51-ADC-examples/ble_app_template__ADC_sampling__app_trace__NUS/main.c
    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

bool adc_calibrate(uint16_t adc_result, uint16_t * adc_result_calibrated, uint8_t adc_resolution)
{
	uint32_t uicr_value;
	uint8_t offset_error;
	uint8_t gain_error;
	bool is_calibrated;
	
	// Apply ADC calibration described on 
	// https://devzone.nordicsemi.com/question/21653/how-to-calibrate-the-nrf51-adc-to-correct-offset-and-gain-error/
	uicr_value = *(uint32_t *)0x10000024;       //Read ADC gain and offset error from UICR
	offset_error = uicr_value;
	gain_error = uicr_value >> 8;
	
	if(adc_resolution == ADC_CONFIG_RES_10bit)
	{
		*adc_result_calibrated = adc_result * (1024 + gain_error) / 1024 + offset_error;    //calibrate
		is_calibrated = true;
	}
	else
	{
		//Calibration method not valid for given ADC resolution. Return adc value uncalibrated.
		*adc_result_calibrated = adc_result;      
		is_calibrated = false;
	}
	return is_calibrated;
}	

#ifdef BOARD_PCA10028
/*
 * Print 3xLSB from the ADC result on LED_2, LED_3 and LED_4 on PCA10028
 */
void write_adc_result_to_leds(uint16_t adc_result)
{
	if(adc_result & 0x01)  
	{
		LEDS_ON(BSP_LED_1_MASK);
	}
	else
	{
		LEDS_OFF(BSP_LED_1_MASK);
	}
	
	if(adc_result & 0x02)  
	{
		LEDS_ON(BSP_LED_2_MASK);
	}
	else
	{
		LEDS_OFF(BSP_LED_2_MASK);
	}
	
	if(adc_result & 0x03)  
	{
		LEDS_ON(BSP_LED_3_MASK);
	}
	else
	{
		LEDS_OFF(BSP_LED_3_MASK);
	}
}
#endif 

//ADC initialization
static void adc_init(void)
{	
	/* Enable interrupt on ADC sample ready event*/		
	NRF_ADC->INTENSET = ADC_INTENSET_END_Msk;   
	sd_nvic_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);  
	sd_nvic_EnableIRQ(ADC_IRQn);
	
	NRF_ADC->CONFIG	= (ADC_CONFIG_EXTREFSEL_None << ADC_CONFIG_EXTREFSEL_Pos) /* Bits 17..16 : ADC external reference pin selection. */
									| (ADC_CONFIG_PSEL_AnalogInput5 << ADC_CONFIG_PSEL_Pos)					/*!< Use analog input 2 as analog input. */
									| (ADC_CONFIG_REFSEL_VBG << ADC_CONFIG_REFSEL_Pos)							/*!< Use internal 1.2V bandgap voltage as reference for conversion. */
									| (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos) /*!< Analog input specified by PSEL with no prescaling used as input for the conversion. */
									| (ADC_CONFIG_RES_8bit << ADC_CONFIG_RES_Pos);									/*!< 8bit ADC resolution. */ 
	
	/* Enable ADC*/
	NRF_ADC->ENABLE = ADC_ENABLE_ENABLE_Enabled;
}

/* Interrupt handler for ADC data ready event */
void ADC_IRQHandler(void)
{
	uint16_t adc_result_calibrated;
	uint8_t adc_result[2];
	
	/* Clear dataready event */
  NRF_ADC->EVENTS_END = 0;	
	
	//Attempt to calibrate the ADC result
	adc_calibrate(NRF_ADC->RESULT, &adc_result_calibrated, ADC_RESOLUTION);
	
#ifdef BOARD_PCA10028	
	//Print ADC result on LEDs
	write_adc_result_to_leds(adc_result_calibrated);
#endif
	
	//app_trace_log("ADC result: %X\r\n", adc_result_calibrated);   //log ADC reult on UART
	
	adc_result[0] = adc_result_calibrated;
	adc_result[1] = adc_result_calibrated >> 8;
	
	app_trace_log("ADC result: %X%X\r\n", adc_result[0], adc_result[1]);   //log ADC reult on UART
	
	ble_nus_string_send(&m_nus, &adc_result[0] , 2);
	
	//Release the external crystal
	sd_clock_hfclk_release();
}	

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
		app_trace_init();   //for logging ADC result on UART
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
		adc_init();         //Initialize ADC
	
    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}

/**
 * @}
 */
